{
    "displayName": "01 - Require MFA for All Privileged Roles",
    "state": "enabled",
    "conditions": {
      "userRiskLevels": [],
      "signInRiskLevels": [],
      "clientAppTypes": [
        "browser",
        "mobileAppsAndDesktopClients"
      ],
      "platforms": null,
      "locations": null,
      "deviceStates": null,
      "applications": {
        "includeApplications": [
          "All"
        ],
        "excludeApplications": [],
        "includeUserActions": []
      },
      "users": {
        "includeUsers": [],
        "excludeUsers": [],
        "includeGroups": [],
        "excludeGroups": [
            "a1001d13-288e-4803-b5b8-f54d4d37891e" 
          ],
        "includeRoles": [
          "62e90394-69f5-4237-9190-012177145e10", 
          "194ae4cb-b126-40b2-bd5b-6091b380977d", 
          "f28a1f50-f6e7-4571-818b-6a12f2af6b6c", 
          "b1be1c3e-b65d-4f19-8427-f6fa0d97feb9", 
          "9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3", 
          "c4e39bd9-1100-46d3-8c65-fb160da0071f", 
          "9f06204d-73c1-4d4c-880a-6edb90606fd8", 
          "b0f54661-2d74-4c50-afa3-1ec803f12efe", 
          "744ec460-397e-42ad-a462-8b3f9747a02c", 
          "3a2c62db-5318-420d-8d74-23affee5d9d5"  

        ],
        "excludeRoles": []
      }
    },
    "grantControls": {
      "operator": "AND",
      "builtInControls": [
        "mfa"
      ],
      "customAuthenticationFactors": [],
      "termsOfUse": []
    },
    "sessionControls": null
  }