{
  "displayName": "Block Legacy Auth",
  "conditions": {
    "applications": {
      "includeApplications": [ "All" ]
    },
    "clientAppTypes": [ "exchangeActiveSync", "other" ],
    "users": {
      "includeUsers": [ "All" ]
    }
  },
  "grantControls": {
    "operator": "OR",
    "builtInControls": [ "block" ]
  },
  "sessionControls": {},
  "state": "enabled"
}
