{
  "displayName": "GLOBAL - 1010 - BLOCK - Legacy Authentication",
  "state": "enabledForReportingButNotEnforced",
  "conditions": {
    "platforms": null,
    "userRiskLevels": [],
    "clientApplications": null,
    "times": null,
    "deviceStates": null,
    "users": {
      "includeGuestsOrExternalUsers": null,
      "includeGroups": [],
      "excludeGuestsOrExternalUsers": null,
      "includeUsers": [
        "All"
      ],
      "excludeUsers": [],
      "excludeGroups": [
        "Excluded from Conditional Access",
        "Excluded from Legacy Authentication Block"
      ],
      "excludeRoles": [],
      "includeRoles": []
    },
    "devices": null,
    "locations": null,
    "clientAppTypes": [
      "exchangeActiveSync",
      "other"
    ],
    "applications": {
      "applicationFilter": null,
      "excludeApplications": [],
      "includeUserActions": [],
      "includeApplications": [
        "All"
      ],
      "includeAuthenticationContextClassReferences": []
    },
    "signInRiskLevels": []
  },
  "grantControls": {
    "operator": "OR",
    "builtInControls": [
      "block"
    ],
    "customAuthenticationFactors": [],
    "termsOfUse": [],
    "authenticationStrength": null
  },
  "sessionControls": null,
  "templateId": null
}